const main = require('../main/main');

describe('pos', function () {
    it('在不含买二赠一商品时，空出挥泪赠送商品一栏，节省处显示0.00(元)', function () {

        spyOn(console, 'log');

        let inputs = [
            'ITEM000002',
            'ITEM000002',
            'ITEM000002',
            'ITEM000002',
            'ITEM000003-3',
            'ITEM000004',
            'ITEM000004',
            'ITEM000004'
        ];


        main(inputs);

        var expectText =
            '***<没钱赚商店>购物清单***\n' +
            '名称：苹果，数量：4斤，单价：5.50(元)，小计：22.00(元)\n' +
            '名称：荔枝，数量：3斤，单价：15.00(元)，小计：45.00(元)\n' +
            '名称：电池，数量：3个，单价：2.00(元)，小计：6.00(元)\n' +
            '----------------------\n' +
            '挥泪赠送商品：\n' +
            '----------------------\n' +
            '总计：73.00(元)\n' +
            '节省：0.00(元)\n' +
            '**********************';

        expect(console.log).toHaveBeenCalledWith(expectText);
    });

        it('在含买二赠一商品但数量不足二时，空出挥泪赠送商品一栏，节省处显示0.00(元)', function () {
    
            spyOn(console, 'log');
    
            let inputs = [
                'ITEM000001',
                'ITEM000002',
                'ITEM000002',
                'ITEM000002',
                'ITEM000002',
                'ITEM000003-3',
                'ITEM000004',
                'ITEM000004',
                'ITEM000004'
            ];
    
    
            main(inputs);
    
            var expectText =
                '***<没钱赚商店>购物清单***\n' +
                '名称：雪碧，数量：1瓶，单价：3.00(元)，小计：3.00(元)\n' +
                '名称：苹果，数量：4斤，单价：5.50(元)，小计：22.00(元)\n' +
                '名称：荔枝，数量：3斤，单价：15.00(元)，小计：45.00(元)\n' +
                '名称：电池，数量：3个，单价：2.00(元)，小计：6.00(元)\n' +
                '----------------------\n' +
                '挥泪赠送商品：\n' +
                '----------------------\n' +
                '总计：76.00(元)\n' +
                '节省：0.00(元)\n' +
                '**********************';
    
            expect(console.log).toHaveBeenCalledWith(expectText);
        });

    it('在含有买二赠一商品时，小计中只计算需要收费的商品价格，并在挥泪赠送商品和节省处打印相关信息', function () {

        spyOn(console, 'log');

        let inputs = [
            'ITEM000001',
            'ITEM000001',
            'ITEM000001',
            'ITEM000001',
            'ITEM000001',
            'ITEM000003-2',
            'ITEM000005',
            'ITEM000005',
            'ITEM000005'
        ];


        main(inputs);

        var expectText =
            '***<没钱赚商店>购物清单***\n' +
            '名称：雪碧，数量：5瓶，单价：3.00(元)，小计：12.00(元)\n' +
            '名称：荔枝，数量：2斤，单价：15.00(元)，小计：30.00(元)\n' +
            '名称：方便面，数量：3袋，单价：4.50(元)，小计：9.00(元)\n' +
            '----------------------\n' +
            '挥泪赠送商品：\n' +
            '名称：雪碧，数量：1瓶\n' +
            '名称：方便面，数量：1袋\n' +
            '----------------------\n' +
            '总计：51.00(元)\n' +
            '节省：7.50(元)\n' +
            '**********************';

        expect(console.log).toHaveBeenCalledWith(expectText);
    });
});
